script/k6-scripts/results/20260619-225054/jwt_false_casbin_false_rl_false_pool_false_smoke.log
 Container RPA-redis Running 
 Container rmqnamesrv Running 
 Container RPA-minio Running 
 Container RPA-pgdb Running 
 Container rmqbroker Running 
 Container RPA-cadvisor Running 
 Container RPA-prometheus Running 
 Container RPA-app Recreate 
 Container RPA-app Recreated 
 Container RPA-app Starting 
 Container RPA-app Started 
 Container script-k6-run-fcdfcb6d199e Creating 
 Container script-k6-run-fcdfcb6d199e Created 

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/smoke.js
        output: Prometheus remote write (http://prometheus:9090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 1 max VUs, 1m30s max duration (incl. graceful stop):
              * smoke: 1 iterations shared among 1 VUs (maxDuration: 1m0s, exec: smoke, gracefulStop: 30s)



  █ THRESHOLDS 

    checks
    ✓ 'rate>0.90' rate=100.00%

    http_req_failed
    ✓ 'rate<0.10' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 4       48.977689/s
    checks_succeeded...: 100.00% 4 out of 4
    checks_failed......: 0.00%   0 out of 4

    ✓ smoke_iam_register status
    ✓ smoke_iam_login status
    ✓ smoke_market_apps_list status
    ✓ smoke_market_rank_daily status

    HTTP
    http_req_duration..............: avg=19.89ms min=1.34ms  med=18.17ms max=41.86ms p(90)=39.12ms p(95)=40.49ms
      { expected_response:true }...: avg=19.89ms min=1.34ms  med=18.17ms max=41.86ms p(90)=39.12ms p(95)=40.49ms
    http_req_failed................: 0.00%  0 out of 4
    http_reqs......................: 4      48.977689/s

    EXECUTION
    iteration_duration.............: avg=81.52ms min=81.52ms med=81.52ms max=81.52ms p(90)=81.52ms p(95)=81.52ms
    iterations.....................: 1      12.244422/s

    NETWORK
    data_received..................: 3.1 kB 38 kB/s
    data_sent......................: 1.5 kB 18 kB/s



running (0m00.1s), 0/1 VUs, 1 complete and 0 interrupted iterations
smoke ✓ [ 100% ] 1 VUs  0m00.1s/1m0s  1/1 shared iters